export class Map_data 
{
    constructor()//ゲーム内で登場する全てのマップの床(0)と壁(1)の配列の座標情報が入っている
    {
        this.heya = [];//マップデータが入る3次配列
        this.i=0;// マップデータの個数管理変数
        this.heya[this.i++] = 
        [
            [1, 1, 1, 1, 1, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 1, 1, 1, 1, 1]
        ];//「now_placeが0」の時に表示されるマップ
        this.heya[this.i++] = 
        [
            [1, 1, 1, 1, 1, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 1, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 1, 1, 1, 1, 1]
        ];//「now_placeが1」の時に表示されるマップ
        this.heya[this.i++] = 
        [
            [1, 1, 1, 1, 1, 1],
            [1, 0, 0, 1, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 1, 1, 1, 1, 1]
        ];//「now_placeが2」の時に表示されるマップ
        this.heya[this.i++] = 
        [
            [1, 1, 1, 1, 1, 1],
            [1, 0, 1, 0, 0, 1],
            [1, 0, 1, 0, 0, 1],
            [1, 0, 1, 0, 0, 1],
            [1, 0, 0, 0, 0, 1],
            [1, 1, 1, 1, 1, 1]
        ];//「now_placeが3」の時に表示されるマップ
    }
    get(){return this.i;}//マップデータの個数取得用のゲッターメソッド
}